In [1]:
import numpy as np
import pandas as pd

In [2]:
ser1 = pd.Series(["one",'two',np.nan,'four'])
ser1

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
"""
Retorna uma serie booleana. 

False para onde há valores,
True para NaN
"""

ser1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
"""
Remove os objetos que eram NaN
"""
ser1.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
"""
Como fazer em um DataFrame
"""

df = pd.DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [9]:
"""
DataFrame.dropna <- Sem argumentos

Remove os NaN, mas remove completamente
as linhas que contem algum elemento NaN.
"""

df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [10]:
"""
Especificando 'how' podemos mudar o comportamento citado acima.

ver: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html

Argumento dropna.(thresh=Numero) Dropa as linhas com o 
numero de NaN's especificado. >= Numero  

"""
df.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [18]:
npn = np.nan

df2 = pd.DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
df2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [11]:
"""
Podemos especificar o Eixo de ação do .drop. 

Ação nas Colunas. Colunas: axis=1
"""

df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [19]:
"""
Fillna method - Preenche todos os NaN com um valor
"""

df2.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [20]:
"""
fillna também recebe string
"""

df2.fillna('-')

   0  1  2  3
0  1  2  3  -
1  2  -  5  6
2  -  7  -  9
3  1  -  -  -

In [21]:
"""
fillna pode receber um dicionario para preencher as colunas como desejado

ex: {0:0,1:1,2:2} <- A coluna 0 preencha os NaN com 0, 
                    a coluna 1 preencha os NaN com 1 ... 
"""

df2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0